---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.InsulationArea
source: html/fa77fb8a-5289-4184-8590-6705cc266cd1.htm
---
# Autodesk.Revit.DB.FabricationPart.InsulationArea Property

The insulation area of the fabrication part. If the fabrication part is not insulated, returns zero.

## Syntax (C#)
```csharp
public double InsulationArea { get; }
```